ConfigFiles/Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/Договоры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Объект.ДатаОкончания = '0001,01,01';
		КонецЕсли;	
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;		
	КонецЕсли;	
КонецПроцедуры  


&НаКлиенте
Процедура СформироватьНаименованиеДоговора() 
	ДатаЗаключенияДоговораБезВремени= Формат(Объект.ДатаНачала,"ДФ='dd.MM.yyyy'");
	Если ЗначениеЗаполнено(Объект.Номер) 
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер + " от " + ДатаЗаключенияДоговораБезВремени+"г.";
	ИначеЕсли  ЗначениеЗаполнено(Объект.Номер)
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + ДатаЗаключенияДоговораБезВремени+"г."; 
	Иначе
		Объект.Наименование = " от " + ДатаЗаключенияДоговораБезВремени+"г.";	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименованиеДоговора(); 
КонецПроцедуры
